x = int("42")
y = int(3.1415)
z = int("hello", base=30)
print(x, y, z, sep='\n')
# ---------------------------------------------
import sys

STEP = 2 ** 16
num = 1
for _ in range(30):
    print(sys.getsizeof(num), num)
    num *= STEP
# ---------------------------------------------
num = 7_123_345_789_967
print(num)
# ---------------------------------------------
num = 2 ** 16 - 1
b = bin(num)  # в двоичной системе исчисления, тип - строка
o = oct(num)  # в 8
h = hex(num)  # в 16
print(b, 0, h)
# ---------------------------------------------
