print(0.2 + 0.3)  # выведет не точное значение
num = 3.678_876_876_987_234_987_456_675  # обрежет окончание числа
print(num)
# ---------------------------------------------
DEFAULT = 42
num_1 = int(input('Введите уровень или ноль для значения по умолчанию: '))  # 0 - это False
level = num_1 or DEFAULT
print(level)
# ---------------------------------------------
name = input('Как вас зовут? ')  # пустая строка возвращает False
if name:
    print('Привет, ' + name)
else:
    print('Анонимус, приветствую')
# ---------------------------------------
data = [0, 1, 1, 2, 3, 5, 8, 13, 21]
while data:
    print(data.pop())

